experiments/gemma-4-12B/serving_rtx5090/reproduction_2026-08-11/stock_c64.txt
============ Benchmark Task ============
recipe_dir: /tmp/emmy-gemma-article-adapted.ca2dkG
variant: rtx5090x1_mc64_np256_ril256_rol256_r1_gmu0.95_ivllm-vllm-oai-v0.23.0
gpu_name: NVIDIA GeForce RTX 5090
gpu_count: 1
recipe:
  model:
    huggingface: google/gemma-4-12B-it
    task: generate
    smoke_test: chat
  engine:
    llm:
      context_length: 16384
      max_concurrent_requests: 64
      tensor_parallel_size: 1
      pipeline_parallel_size: 1
      data_parallel_size: 1
      gpu_memory_utilization: 0.95
      vllm:
        image: vllm/vllm-openai:v0.23.0
        extra_args: --dtype float16 --no-enable-prefix-caching
        extra_env: {}
      sglang: null
      docker_options: {}
  benchmark:
    max_concurrency: 64
    num_prompts: 256
    random_input_len: 256
    random_output_len: 256
    seed: 0
    temperature: 0
    ignore_eos: true
    repeats: 1
  deploy:
    gpu: NVIDIA GeForce RTX 5090
    gpu_count: 1
    driver_version: null
    cuda_version: null
  command: null
  aggregate: null
==================================================

============ Serving Benchmark Result ============
Successful requests:                     256
Failed requests:                         0
Maximum request concurrency:             64
Benchmark duration (s):                  46.13
Total input tokens:                      65536
Total generated tokens:                  65536
Request throughput (req/s):              5.55
Output token throughput (tok/s):         1420.70
Peak output token throughput (tok/s):    2773.00
Peak concurrent requests:                87.00
Total token throughput (tok/s):          2841.40
---------------Time to First Token----------------
Mean TTFT (ms):                          1983.79
Median TTFT (ms):                        1445.13
P99 TTFT (ms):                           6180.16
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.61
Median TPOT (ms):                        28.82
P99 TPOT (ms):                           55.59
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.61
Median ITL (ms):                         22.92
P99 ITL (ms):                            281.00
==================================================

============ Docker Compose Configuration ============
services:

  vllm_0:
    image: vllm/vllm-openai:v0.23.0
    container_name: vllm_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    restart: unless-stopped
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.95
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 1
      --data-parallel-size 1
      --model google/gemma-4-12B-it
      --served-model-name google/gemma-4-12B-it
      --max-model-len 16384
      --max-num-seqs 64
      --dtype float16 --no-enable-prefix-caching
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 1200s
==================================================

============ Benchmark Command ============
vllm bench serve
    --model google/gemma-4-12B-it
    --trust-remote-code
    --max-concurrency 64
    --num-prompts 256
    --random-input-len 256
    --seed 0
    --random-output-len 256
    --temperature 0
    --ignore-eos
    --base-url http://localhost:8000
==================================================

============ Timing ============
remote_provision            0.9s
image_pull                  0.9s
model_download              1.1s
model_load_and_warmup     106.5s
  startup                  60.8s
  weights_load              9.0s
  torch_compile            18.7s
  engine_warmup            13.9s
  cuda_graph_capture        4.0s
smoke_test                  1.2s
benchmark                  57.6s
total                     168.1s
==================================================

============ System Information ============
=== HOSTNAME ===
kenshin

=== OS ===
PRETTY_NAME="Ubuntu 24.04.2 LTS"
NAME="Ubuntu"
VERSION_ID="24.04"
VERSION="24.04.2 LTS (Noble Numbat)"
VERSION_CODENAME=noble
ID=ubuntu
ID_LIKE=debian
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
UBUNTU_CODENAME=noble
LOGO=ubuntu-logo

=== KERNEL ===
7.0.0-28-generic

=== CPU INFORMATION ===
Architecture:                            x86_64
CPU op-mode(s):                          32-bit, 64-bit
Address sizes:                           48 bits physical, 48 bits virtual
Byte Order:                              Little Endian
CPU(s):                                  32
On-line CPU(s) list:                     0-31
Vendor ID:                               AuthenticAMD
Model name:                              AMD Ryzen 9 9950X3D 16-Core Processor
CPU family:                              26
Model:                                   68
Thread(s) per core:                      2
Core(s) per socket:                      16
Socket(s):                               1
Stepping:                                0
Frequency boost:                         enabled
CPU(s) scaling MHz:                      65%
CPU max MHz:                             5756.4521
CPU min MHz:                             624.1940
BogoMIPS:                                8584.73
Flags:                                   fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ht syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm constant_tsc rep_good amd_lbr_v2 nopl xtopology nonstop_tsc cpuid extd_apicid aperfmperf rapl pni pclmulqdq monitor ssse3 fma cx16 sse4_1 sse4_2 movbe popcnt aes xsave avx f16c rdrand lahf_lm cmp_legacy svm extapic cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw ibs skinit wdt tce topoext perfctr_core perfctr_nb bpext perfctr_llc mwaitx cpuid_fault cpb cat_l3 cdp_l3 hw_pstate ssbd mba perfmon_v2 ibrs ibpb stibp ibrs_enhanced vmmcall fsgsbase tsc_adjust bmi1 avx2 smep bmi2 erms invpcid cqm rdt_a avx512f avx512dq adx smap avx512ifma clflushopt clwb avx512cd sha_ni avx512bw avx512vl xsaveopt xsavec xgetbv1 xsaves cqm_llc cqm_occup_llc cqm_mbm_total cqm_mbm_local user_shstk avx_vnni avx512_bf16 clzero irperf xsaveerptr rdpru wbnoinvd cppc arat npt lbrv svm_lock nrip_save tsc_scale vmcb_clean flushbyasid decodeassists pausefilter pfthreshold avic v_vmsave_vmload vgif x2avic v_spec_ctrl vnmi avx512vbmi umip pku ospke avx512_vbmi2 gfni vaes vpclmulqdq avx512_vnni avx512_bitalg avx512_vpopcntdq rdpid bus_lock_detect movdiri movdir64b overflow_recov succor smca fsrm avx512_vp2intersect flush_l1d amd_lbr_pmc_freeze
Virtualization:                          AMD-V
L1d cache:                               768 KiB (16 instances)
L1i cache:                               512 KiB (16 instances)
L2 cache:                                16 MiB (16 instances)
L3 cache:                                128 MiB (2 instances)
NUMA node(s):                            1
NUMA node0 CPU(s):                       0-31
Vulnerability Gather data sampling:      Not affected
Vulnerability Ghostwrite:                Not affected
Vulnerability Indirect target selection: Not affected
Vulnerability Itlb multihit:             Not affected
Vulnerability L1tf:                      Not affected
Vulnerability Mds:                       Not affected
Vulnerability Meltdown:                  Not affected
Vulnerability Mmio stale data:           Not affected
Vulnerability Old microcode:             Not affected
Vulnerability Reg file data sampling:    Not affected
Vulnerability Retbleed:                  Not affected
Vulnerability Spec rstack overflow:      Mitigation; IBPB on VMEXIT only
Vulnerability Spec store bypass:         Mitigation; Speculative Store Bypass disabled via prctl
Vulnerability Spectre v1:                Mitigation; usercopy/swapgs barriers and __user pointer sanitization
Vulnerability Spectre v2:                Mitigation; Enhanced / Automatic IBRS; IBPB conditional; STIBP always-on; PBRSB-eIBRS Not affected; BHI Not affected
Vulnerability Srbds:                     Not affected
Vulnerability Tsa:                       Not affected
Vulnerability Tsx async abort:           Not affected
Vulnerability Vmscape:                   Mitigation; IBPB on VMEXIT

=== CPU COUNT ===
32

=== MEMORY ===
               total        used        free      shared  buff/cache   available
Mem:            60Gi        13Gi       6.5Gi        41Mi        40Gi        47Gi
Swap:          8.0Gi       3.6Gi       4.4Gi

=== GPU INFORMATION ===
NVIDIA GeForce RTX 5090, 32607 MiB, 580.173.02, P8, 43, 0 %

=== GPU DETAILS ===
Tue Aug 11 01:03:21 2026
+-----------------------------------------------------------------------------------------+
| NVIDIA-SMI 580.173.02             Driver Version: 580.173.02     CUDA Version: 13.0     |
+-----------------------------------------+------------------------+----------------------+
| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |
| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |
|                                         |                        |               MIG M. |
|=========================================+========================+======================|
|   0  NVIDIA GeForce RTX 5090        Off |   00000000:01:00.0 Off |                  N/A |
|  0%   43C    P8             13W /  575W |     768MiB /  32607MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+

+-----------------------------------------------------------------------------------------+
| Processes:                                                                              |
|  GPU   GI   CI              PID   Type   Process name                        GPU Memory |
|        ID   ID                                                               Usage      |
|=========================================================================================|
|    0   N/A  N/A         3994990      G   /usr/lib/xorg/Xorg                      588MiB |
|    0   N/A  N/A         3995196      G   /usr/bin/gnome-shell                     15MiB |
|    0   N/A  N/A         4009957      G   .../8736/usr/lib/firefox/firefox         37MiB |
|    0   N/A  N/A         4013193      G   ...log/jcef_chromium_4012855.log          9MiB |
+-----------------------------------------------------------------------------------------+

=== DISK USAGE ===
Filesystem      Size  Used Avail Use% Mounted on
tmpfs           6.1G  5.1M  6.1G   1% /run
/dev/nvme0n1p2  3.6T  2.6T  903G  75% /
tmpfs            31G  6.5M   31G   1% /dev/shm
tmpfs           5.0M   28K  5.0M   1% /run/lock
efivarfs        128K   25K   99K  20% /sys/firmware/efi/efivars
tmpfs            31G     0   31G   0% /run/qemu
/dev/nvme0n1p1  1.1G  6.2M  1.1G   1% /boot/efi
tmpfs           6.1G   12M  6.1G   1% /run/user/1000
/dev/sda1       140K   48K   92K  35% /media/dikobraz/SCARLETT
N/A

=== BLOCK DEVICES ===
NAME        MAJ:MIN RM   SIZE RO TYPE MOUNTPOINTS
loop0         7:0    0     4K  1 loop /snap/bare/5
loop1         7:1    0  63.8M  1 loop /snap/core20/2769
loop2         7:2    0    74M  1 loop /snap/core22/2339
loop3         7:3    0  75.5M  1 loop /snap/ffmpeg-2404/139
loop4         7:4    0    74M  1 loop /snap/core22/2411
loop5         7:5    0  63.8M  1 loop /snap/core20/2866
loop6         7:6    0  66.8M  1 loop /snap/core24/1643
loop8         7:8    0 265.6M  1 loop /snap/discord/301
loop9         7:9    0  66.8M  1 loop /snap/core24/1587
loop10        7:10   0 257.6M  1 loop /snap/firefox/8664
loop11        7:11   0  16.4M  1 loop /snap/firmware-updater/224
loop12        7:12   0  16.5M  1 loop /snap/firmware-updater/226
loop13        7:13   0  11.8M  1 loop /snap/snap-store/1390
loop14        7:14   0 140.2M  1 loop /snap/gimp/558
loop15        7:15   0 349.7M  1 loop /snap/gnome-3-38-2004/143
loop16        7:16   0 531.5M  1 loop /snap/gnome-42-2204/263
loop17        7:17   0  75.5M  1 loop /snap/ffmpeg-2404/149
loop18        7:18   0 140.4M  1 loop /snap/gimp/560
loop19        7:19   0 531.4M  1 loop /snap/gnome-42-2204/247
loop20        7:20   0 606.1M  1 loop /snap/gnome-46-2404/153
loop21        7:21   0 614.5M  1 loop /snap/gnome-46-2404/164
loop22        7:22   0  91.7M  1 loop /snap/gtk-common-themes/1535
loop23        7:23   0   1.2G  1 loop /snap/libreoffice/374
loop24        7:24   0   1.1G  1 loop /snap/libreoffice/377
loop25        7:25   0   395M  1 loop /snap/mesa-2404/1165
loop26        7:26   0 138.9M  1 loop /snap/slack/253
loop27        7:27   0   402M  1 loop /snap/mesa-2404/1839
loop28        7:28   0 225.9M  1 loop /snap/slack/254
loop29        7:29   0  15.7M  1 loop /snap/snap-store/1367
loop30        7:30   0 265.6M  1 loop /snap/discord/302
loop31        7:31   0  50.1M  1 loop /snap/snapd/27406
loop32        7:32   0  50.1M  1 loop /snap/snapd/27591
loop33        7:33   0   828K  1 loop /snap/snapd-desktop-integration/387
loop34        7:34   0   828K  1 loop /snap/snapd-desktop-integration/391
loop35        7:35   0 257.7M  1 loop /snap/firefox/8736
loop36        7:36   0 219.9M  1 loop /snap/thunderbird/1201
loop37        7:37   0  99.3M  1 loop /snap/telegram-desktop/7092
loop38        7:38   0 210.8M  1 loop /snap/thunderbird/1170
loop39        7:39   0  99.3M  1 loop /snap/telegram-desktop/7100
sda           8:0    1   192K  1 disk
└─sda1        8:1    1 160.5K  1 part /media/dikobraz/SCARLETT
nvme1n1     259:0    0   3.6T  0 disk
nvme0n1     259:1    0   3.6T  0 disk
├─nvme0n1p1 259:2    0     1G  0 part /boot/efi
└─nvme0n1p2 259:3    0   3.6T  0 part /

=== UPTIME ===
 01:03:21 up 5 days, 13:03,  4 users,  load average: 0.68, 0.95, 0.78

=== DOCKER VERSION ===
Docker version 29.5.0, build 98f1464

=== DOCKER INFO ===
29.5.0 | OS: Ubuntu 24.04.2 LTS | Containers: 11 | Images: 86
==================================================